hn_two_columns/hn_two_columns.user.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-03 Fri 13:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Two column layout for Hacker News</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="benrudgers" />
</head>
<body>
<div id="content">
<h1 class="title">Two column layout for Hacker News</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5cb7735">Preface</a></li>
<li><a href="#orgbff4f56">Introduction: HN's HTML</a></li>
<li><a href="#org4784bd2">Header</a></li>
<li><a href="#org9856007">Body</a>
<ul>
<li><a href="#orgab8683e">Setup Document Structure</a></li>
<li><a href="#org2444af3">Scraping</a>
<ul>
<li><a href="#orge38db23">CSS class itemlist</a></li>
<li><a href="#org00ca82b">A story item</a></li>
<li><a href="#orgebb9584">Building the table</a></li>
</ul>
</li>
<li><a href="#orgaa1aa36">Construct Columns</a></li>
<li><a href="#org976f14e">Construct top level</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5cb7735" class="outline-2">
<h2 id="org5cb7735">Preface</h2>
<div class="outline-text-2" id="text-org5cb7735">
<p>
This code is designed to run as a user script in FireFox using GreaseMonkey. It creates a two column layout for the Hacker News Main page and similar Hacker News pages that are lists of thirty stories.
</p>

<p>
It should also run in Chrome or Chromium using the TamperMonkey plugin. However, TamperMonkey's implementation does not allow it to read files and the code must be copy pasted into the TamperMonkey editor or imported with some sort of database workaround if such a thing exists.
</p>
</div>
</div>
<div id="outline-container-orgbff4f56" class="outline-2">
<h2 id="orgbff4f56">Introduction: HN's HTML</h2>
<div class="outline-text-2" id="text-orgbff4f56">
<p>
There's a lot of griping about Hacker News's use of tables as if it was 1997&#x2026;I've committed some of it (along with cursing). Usually it is motivated by the idea that CSS [and particularly CSS grids] would be better.
</p>

<p>
I'm pretty much convinced that it would not. Organizing an HTML page with tables versus a CSS grid means that a page's structure can be generated recursively by a server side program more directly. There's no keeping track of which <code>&lt;div&gt;</code> gets some class to  <code>&lt;float-left&gt;</code> and which does not and hence will appear on the right (hopefully if all goes well). The first <code>&lt;td&gt;</code> will be left of the next. The first <code>&lt;tr&gt;</code> will be above the next.
</p>

<p>
Sequences are an excellent way of organizing information left2right and top2bottom without a lot of hand-crafted design effort and a letting the browser handle as much of the layout with its defaults as practical is not an unreasonable tradeoff much of the time.
</p>
<blockquote>
<p>
It is better to have 100 functions operate on one data structure than 10 functions on 10 data structures." —Alan Perlis
</p>
</blockquote>
<p>
It's probably better to have that one data structure be as simple as possible (but no simpler), too.
</p>
</div>
</div>

<div id="outline-container-org4784bd2" class="outline-2">
<h2 id="org4784bd2">Header</h2>
<div class="outline-text-2" id="text-org4784bd2">
<p>
Just some regular GreaseMonkey Boiler Plate. The comment format is used by GreaseMonkey as meta-data. 
The namespace uses the traditional Java format (I own Kludgecode.com) because I have not seen a better way of choosing namespaces to avoid collisions. Not that namespaces are particularly important in the current context.
</p>
<div class="org-src-container">
<pre class="src src-js">// ==UserScript==
// @name        hn_two_columns
// @namespace   com.kludgecode.hn
// @description Two column layout for Hacker News Main page and similar pages
</pre>
</div>
<p>
The script will run on the following pages.
</p>
<div class="org-src-container">
<pre class="src src-js">// @include     https://news.ycombinator.com/news*
// @include     https://news.ycombinator.com/ask*
// @include     https://news.ycombinator.com/show*
// @include     https://news.ycombinator.com/new*
</pre>
</div>
<p>
Given the Github, I'm not sure I'll keep up with versioning but you never know&#x2026;and I can make the bold claim that this is actually a 1.0 release! 
The script grants no priviledges because none of the command need access to anything that lives outside the portions of the DOM and browser that are normally accessible to JavaScript.
</p>
<div class="org-src-container">
<pre class="src src-js">// @version     1
// @grant       none
// ==/UserScript==
</pre>
</div>
</div>
</div>
<div id="outline-container-org9856007" class="outline-2">
<h2 id="org9856007">Body</h2>
<div class="outline-text-2" id="text-org9856007">
<p>
The code more or less does two things:
</p>
<ol class="org-ol">
<li>It scrapes the Hacker News markup for the thirty story items.</li>
<li>It creates an HTML <code>&lt;tr&gt;</code> element with two <code>&lt;td&gt;</code> elements. One for the left column and one for the right column. It writes the first fifteen items to the left column's <code>&lt;td&gt;</code> and the next fifteen plus the |more| link to the right hand column's <code>&lt;td&gt;</code>.</li>
</ol>
</div>
<div id="outline-container-orgab8683e" class="outline-3">
<h3 id="orgab8683e">Setup Document Structure</h3>
<div class="outline-text-3" id="text-orgab8683e">
<p>
The highest level element of the structure we are building is an HTML <code>&lt;tr&gt;</code> element. It will be inserted into an existing table.
</p>
<div class="org-src-container">
<pre class="src src-js">(function () {
// r is the container for the content we build
var r = document.createElement('tr');
</pre>
</div>
<p>
The two column layout will utilize <code>&lt;td&gt;</code> elements that will be inserted into the new table row. <code>left</code> will hold the first fifteen stories, <code>right</code> will hold the second fifteen plus the <code>|more|</code> link to the next page.
</p>
<div class="org-src-container">
<pre class="src src-js">// it will display two columns
var left = document.createElement('td');
var right = document.createElement('td');
</pre>
</div>
</div>
</div>

<div id="outline-container-org2444af3" class="outline-3">
<h3 id="org2444af3">Scraping</h3>
<div class="outline-text-3" id="text-org2444af3">
<p>
There were some earlier versions of this code that did not include the <code>|more|</code> link that paginates Hacker News pages. Adding it significantly improved the user experience&#x2026;well at least my user experience.
</p>

<div class="org-src-container">
<pre class="src src-js">// get More link
var moreLink = document.getElementsByClassName('morelink')[0];
</pre>
</div>
<p>
A Hacker News page is a hodgepodge of old style tables and some CSS and a bit of JavaScript. The CSS class <code>itemlist</code> lets us find the stories.
</p>
</div>
<div id="outline-container-orge38db23" class="outline-4">
<h4 id="orge38db23">CSS class itemlist</h4>
<div class="outline-text-4" id="text-orge38db23">
<p>
There is only one element in the css class <code>itemlist</code>, a table containing all the stories. Because <code>getElementsByClassName</code> returns a collection, we have to pull the table out by its index.
</p>
<div class="org-src-container">
<pre class="src src-js">// itemList[0] is the target document element
var itemList = document.getElementsByClassName('itemlist')[0];
</pre>
</div>
</div>
</div>

<div id="outline-container-org00ca82b" class="outline-4">
<h4 id="org00ca82b">A story item</h4>
<div class="outline-text-4" id="text-org00ca82b">
<p>
Each story element consists of a table with two rows. The table has no directly assigned CSS class but the first <code>&lt;tr&gt;</code> is assigned <code>athing</code>.
</p>
<pre class="example">
&lt;table&gt;
  &lt;tb&gt;
    &lt;tr class='athing'&gt; &lt;/tr&gt;
    &lt;tr&gt; &lt;/tr&gt;
  &lt;/tb&gt;
&lt;/table&gt;
</pre>
<p>
On Hacker News <code>athing</code> is used as the CSS class for a generic container. On Hacker News 30 item pages, <code>athing</code>'s are <code>&lt;tr&gt;</code> elements containing three <code>&lt;td&gt;</code> elements (<code>athing</code>'s have different <code>&lt;td&gt;</code>'s on pages with comments). 
</p>

<p>
The code uses <code>Array.prototype.slice</code> to convert a DOM collection into a JavaScript array. You'd think there would be a <code>toArray</code> method twenty years after JavaScript came on the scene. You'd be wrong.
</p>
<div class="org-src-container">
<pre class="src src-js">// An array of the first row of each item
var row1 = Array.prototype.slice.call(document.getElementsByClassName('athing'), 0);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgebb9584" class="outline-4">
<h4 id="orgebb9584">Building the table</h4>
<div class="outline-text-4" id="text-orgebb9584">
<p>
For each <code>athing</code> we will push it's next sibling [the second <code>&lt;tr&gt;</code> element of a story] into an array. 
</p>

<p>
While in that loop, we'll make an arrays of 
</p>
<ol class="org-ol">
<li><code>&lt;tb&gt;</code> elements that can wrap the <code>athing</code> <code>&lt;tr&gt;</code> and its sibling <code>&lt;tr&gt;</code></li>
<li><code>&lt;table&gt;</code> elements that will eventually contain the <code>&lt;tb&gt;</code> elements.</li>
</ol>

<div class="org-src-container">
<pre class="src src-js">// the second row of each item; a table body that wraps both rows; a table that wraps the table body
var row2 = []; tb = []; t = [];

// control the loops
var len = row1.length;

// build the rest of the elements
for (var i = 0; i &lt; len; i++) {
  row2.push(row1[i].nextElementSibling);
  tb.push(document.createElement('tb'));
  t.push(document.createElement('table'));
};
</pre>
</div>

<p>
Next we loop through the array of <code>&lt;tb&gt;</code> elements twice. First appending the <code>athing</code>'s, then appending the sibling second row.
</p>

<div class="org-src-container">
<pre class="src src-js">// add row1 elements to table body
 for (var i = 0; i &lt; len; i++) {
   tb[i].appendChild(row1[i]);
 };
 // add row2 elements to table body
 for (var i = 0; i &lt; len; i++) {
   tb[i].appendChild(row2[i]);
 };
</pre>
</div>

<p>
Finally, we construct the table for each story by appending the <code>&lt;tb&gt;</code>'s.
</p>

<div class="org-src-container">
<pre class="src src-js">// insert table bodies into item tables
for (var i = 0; i &lt; len; i++) {
  t[i].appendChild(tb[i]);
};
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgaa1aa36" class="outline-3">
<h3 id="orgaa1aa36">Construct Columns</h3>
<div class="outline-text-3" id="text-orgaa1aa36">
<p>
Insert the tables containing the stories into the top level <code>&lt;td&gt;</code> elements.
</p>
<div class="org-src-container">
<pre class="src src-js">// build left column
for (var i = 0; i &lt; len / 2; i++) {
  left.appendChild(t[i])
};
//build right column
for (var i = len / 2; i &lt; len; i++) {
  right.appendChild(t[i])
};
</pre>
</div>
<p>
And don't forget the the <code>|more|</code> link.
</p>
<div class="org-src-container">
<pre class="src src-js">right.appendChild(moreLink); // don't forget the More link
</pre>
</div>
</div>
</div>
<div id="outline-container-org976f14e" class="outline-3">
<h3 id="org976f14e">Construct top level</h3>
<div class="outline-text-3" id="text-org976f14e">
<div class="org-src-container">
<pre class="src src-js">// build row for itemList
r.appendChild(left);
r.appendChild(right);
</pre>
</div>
<p>
Erease existing list of stories and replace with the new two column structure.
</p>
<div class="org-src-container">
<pre class="src src-js">  // clear existing structure from itemList
  itemList.innerHTML = "";
  // insert new structure in itemList
  itemList.append(r)
})();
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: benrudgers</p>
<p class="date">Created: 2017-03-03 Fri 13:21</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
